"""
dist:  moves

1: 1
2: 1 1
3: 1 1 1
4: 1 2 1                   new
5: 1 2 1 1
6: 1 2 2 1
7: 1 2 2 1 1
8: 1 2 2 2 1
9: 1 2 3 2 1               new
10: 1 2 3 2 1 1
11: 1 2 3 2 2 1
12: 1 2 3 3 2 1
13: 1 2 3 3 2 1 1
14: 1 2 3 3 2 2 1
15: 1 2 3 3 3 2 1
16: 1 2 3 4 3 2 1          new
17: 1 2 3 4 3 2 1 1
18: 1 2 3 4 3 2 2 1
19: 1 2 3 4 3 3 2 1
20: 1 2 3 4 4 3 2 1
21: 1 2 3 4 4 3 2 1 1
22: 1 2 3 4 4 3 2 2 1
23: 1 2 3 4 4 3 3 2 1
24: 1 2 3 4 4 4 3 2 1
25: 1 2 3 4 5 4 3 2 1     new

a**2: 1 2 ... a-1 a a-1 ... 2 1   new (개수: 2*a - 1)
같은 개수 범위: a**2 - a + 1 부터 a**2까지.
개수 + 1 범위: a**2 + 1 부터 a**2 + a까지.
ex. a=4. a**2=16. 13~16: 7개. 17~20: 8개.
"""

def min_sq(n):
    i = 0
    while i**2 < n:
        i += 1
    if n < i**2 - i + 1:
        return 2*i - 2
    else:
        return 2*i - 1
     
t = int(input())
res = list()

for i in range(t):
    x, y = map(int, input().split())
    res.append(min_sq(y - x))

for i in range(len(res)):
    print(res[i])